# SetSelect

## Description
Procedure SetSelect selects the referenced object.

```pascal
PROCEDURE SetSelect(h : HANDLE);
```

```python
def vs.SetSelect(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Remarks
To select an object in a Wall you must select both the object and the Wall.

## Version
Availability: from All Versions

## Category
* Selection